package com.sunchaser.rpc.core.protocol;

import lombok.AllArgsConstructor;
import lombok.Builder;
import lombok.Data;
import lombok.NoArgsConstructor;

import java.io.Serializable;

/**
 * rpc 消息头
 * <p>
 * +------------------------------------------------------------------------+
 * 丨 Bit位 丨 0-7 丨      8-15      丨      16-23      丨  24-87 丨  88-119  丨
 * +------------------------------------------------------------------------+
 * 丨 协议头 丨 魔数 丨 协议版本+消息类型 丨 压缩方式+序列化方式 丨 序列ID 丨 消息体长度 丨
 * +------------------------------------------------------------------------+
 * 丨                 协议头扩展字段（长度不固定，由协议头长度决定）                 丨
 * +------------------------------------------------------------------------+
 * 丨                          消息体（实际发送的数据）                          丨
 * +------------------------------------------------------------------------+
 * <p>
 * +------------------------------------------------------+
 * 丨                 协议版本+消息类型 1byte                丨
 * +------------------------------------------------------+
 * 丨   0   丨  1  丨  2  丨  3  丨  4  丨  5  丨  6  丨  7  丨
 * +------------------------------------------------------+
 * 丨 符号位 丨             协议版本            丨  消息类型   丨
 * +------------------------------------------------------+
 * <p>
 * +----------------------------------------------------+
 * 丨                 压缩方式+序列化方式 1byte             丨
 * +----------------------------------------------------+
 * 丨  0  丨  1  丨  2  丨  3  丨  4  丨  5  丨  6  丨  7  丨
 * +----------------------------------------------------+
 * 丨         压缩方式         丨         序列化方式        丨
 * +----------------------------------------------------+
 * <p>
 * 可扩展协议
 * +-----------------------------------------------------------------------------------+
 * 丨 Bit位 丨 0-7 丨      8-15      丨      16-23      丨  24-87 丨  88-103  丨 104-135  丨
 * +-----------------------------------------------------------------------------------+
 * 丨 协议头 丨 魔数 丨 协议版本+消息类型 丨 压缩方式+序列化方式 丨 序列ID 丨 协议头长度 丨 消息体长度 丨
 * +-----------------------------------------------------------------------------------+
 * 丨                        协议头扩展字段（长度不固定，由协议头长度决定）                     丨
 * +-----------------------------------------------------------------------------------+
 * 丨                                消息体（实际发送的数据）                               丨
 * +-----------------------------------------------------------------------------------+
 *
 * @author sunchaser admin@lilu.org.cn
 * @since JDK8 2022/7/12
 */
@Data
@AllArgsConstructor
@NoArgsConstructor
@Builder
public class RpcHeader implements Serializable {

    private static final long serialVersionUID = 3050587176252634022L;

    /**
     * 魔数：1101110
     * 天王盖地虎
     * 宝塔镇河妖
     */
    private byte magic;

    /**
     * 协议版本+消息类型
     * 消息类型：
     * 00：REQUEST
     * 01：RESPONSE
     * 11：HEARTBEAT
     */
    private byte versionAndType;

    /**
     * 压缩方式+序列化方式
     */
    private byte compressAndSerialize;

    /**
     * 序列ID
     */
    private long sequenceId;

    /**
     * 消息体长度
     */
    private int bodyLength;
}
