package com.sunchaser.shushan.rpc.core.protocol;

import lombok.AllArgsConstructor;
import lombok.Builder;
import lombok.Data;
import lombok.NoArgsConstructor;

import java.io.Serializable;

/**
 * rpc 消息头
 * <p>
 * +--------------------------------------------------------------------+
 * | Bit位 | 0-7 |      8-15      |      16-23      |  24-87 |  88-119  |
 * +--------------------------------------------------------------------+
 * | 协议头 | 魔数 | 协议版本+消息类型 | 压缩方式+序列化方式 | 序列ID | 消息体长度 |
 * +--------------------------------------------------------------------+
 * | 协议体 |                   消息体（实际发送的数据）                      |
 * +--------------------------------------------------------------------+
 * <p>
 * +-----------------------------------------------+
 * |             协议版本+消息类型 1byte              |
 * +-----------------------------------------------+
 * |  0  |  1  |  2  |  3  |  4  |  5  |  6  |  7  |
 * +-----------------------------------------------+
 * |符号位|             协议版本          |  消息类型  |
 * +-----------------------------------------------+
 * <p>
 * +-----------------------------------------------+
 * |             压缩方式+序列化方式 1byte             |
 * +-----------------------------------------------+
 * |  0  |  1  |  2  |  3  |  4  |  5  |  6  |  7  |
 * +-----------------------------------------------+
 * |        压缩方式        |        序列化方式        |
 * +-----------------------------------------------+
 * <p>
 * 可扩展协议
 * +-------------------------------------------------------------------------------+
 * | Bit位 | 0-7 |      8-15      |      16-23      |  24-87 |  88-103  | 104-135  |
 * +-------------------------------------------------------------------------------+
 * | 协议头 | 魔数 | 协议版本+消息类型 | 压缩方式+序列化方式 | 序列ID | 协议头长度 | 消息体长度 |
 * +-------------------------------------------------------------------------------+
 * |                     协议头扩展字段（长度不固定，由协议头长度决定）                     |
 * +-------------------------------------------------------------------------------+
 * |                              消息体（实际发送的数据）                              |
 * +-------------------------------------------------------------------------------+
 *
 * @author sunchaser admin@lilu.org.cn
 * @since JDK8 2022/7/12
 */
@Data
@AllArgsConstructor
@NoArgsConstructor
@Builder
public class RpcHeader implements Serializable {

    private static final long serialVersionUID = 3050587176252634022L;

    /**
     * 魔数：1101110
     * 天王盖地虎
     * 宝塔镇河妖
     */
    private byte magic;

    /**
     * 协议版本+消息类型
     * 消息类型：
     * 00：REQUEST
     * 01：RESPONSE
     * 11：HEARTBEAT
     */
    private byte versionAndType;

    /**
     * 压缩方式+序列化方式
     */
    private byte compressAndSerialize;

    /**
     * 序列ID
     */
    private long sequenceId;

    /**
     * 消息体长度
     */
    private int bodyLength;
}
